Documents/ЗаданиеТорговомуПредставителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаданиеТорговомуПредставителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчетПоЗонамДоставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВернутьМногооборотнуюТару</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеОтгружатьЧастями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВизитаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВизитаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УсловияОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияОбслуживанияПартнеровТорговымиПредставителями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданийТорговымПредставителям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокВозвратаМногооборотнойТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТребуетсяЗалогЗаТару</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческоеПредложениеКлиенту</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КоммерческоеПредложениеКлиенту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГрафикОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДетализацияПоНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>САВ_Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Задачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Выполнена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОписаниеЗадачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОписаниеРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовКлиентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковокПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураКлиента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтапыГрафикаОплаты</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаданиеТорговомуПредставителю/Forms/РСК_ФормаПодбораСтрок/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Основание") Тогда
		ДокументОснование = Параметры.Основание;
		Соисполнитель 	  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"ТорговыйПредставитель"); 
		ЗаполнитьСписокДокументов();		
	КонецЕсли;  
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокДокументов()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ОтборНеУстановлен",НЕ ЗначениеЗаполнено(Соисполнитель));
	Запрос.УстановитьПараметр("ТорговыйПредставитель",Соисполнитель);
	Запрос.УстановитьПараметр("Основание",ДокументОснование);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Количество КАК Количество,
	|	СУММА(РСК_ОтраженныеУслугиСоисполнителей.Количество) КАК Количество1,
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОстаткиПоДокументам
	|ИЗ
	|	Документ.ЗаданиеТорговомуПредставителю.САВ_Услуги КАК ЗаданиеТорговомуПредставителюСАВ_Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РСК_ОтраженныеУслугиСоисполнителей КАК РСК_ОтраженныеУслугиСоисполнителей
	|		ПО ЗаданиеТорговомуПредставителюСАВ_Услуги.Ссылка = РСК_ОтраженныеУслугиСоисполнителей.ЗаданиеТорговомуПредставителю
	|			И ЗаданиеТорговомуПредставителюСАВ_Услуги.Номенклатура = РСК_ОтраженныеУслугиСоисполнителей.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Количество,
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Ссылка
	|
	|ИМЕЮЩИЕ
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Количество - СУММА(ЕСТЬNULL(РСК_ОтраженныеУслугиСоисполнителей.Количество, 0)) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеТорговомуПредставителю.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЗаданиеТорговомуПредставителю.Ссылка В (&Основание)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	Документ.ЗаданиеТорговомуПредставителю КАК ЗаданиеТорговомуПредставителю
	|ГДЕ
	|	(&ОтборНеУстановлен
	|			ИЛИ ЗаданиеТорговомуПредставителю.ТорговыйПредставитель = &ТорговыйПредставитель)
	|	И ЗаданиеТорговомуПредставителю.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ОстаткиПоДокументам.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_ОстаткиПоДокументам КАК ВТ_ОстаткиПоДокументам)";  
	
	Результат = Запрос.Выполнить().Выгрузить();
	СписокДокументов.Загрузить(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда) 
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПодборСтрок;
	ДалееНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ДалееНаСервере()
	ЗаполнитьСписокСтрок();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокСтрок() 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокДокументов",СписокДокументов.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокДокументов.Ссылка КАК Ссылка,
	|	СписокДокументов.Пометка КАК Пометка
	|ПОМЕСТИТЬ ВТ_ДокументыДляФормирования
	|ИЗ
	|	&СписокДокументов КАК СписокДокументов
	|ГДЕ
	|	СписокДокументов.Пометка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Номенклатура КАК Услуга,
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Количество - СУММА(ЕСТЬNULL(РСК_ОтраженныеУслугиСоисполнителей.Количество, 0)) КАК КоличествоДоступно,
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Цена КАК Цена,
	|	0 КАК Сумма,
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Содержание КАК Содержание,
	|	ВТ_ДокументыДляФормирования.Ссылка КАК Документ
	|ИЗ
	|	ВТ_ДокументыДляФормирования КАК ВТ_ДокументыДляФормирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеТорговомуПредставителю.САВ_Услуги КАК ЗаданиеТорговомуПредставителюСАВ_Услуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РСК_ОтраженныеУслугиСоисполнителей КАК РСК_ОтраженныеУслугиСоисполнителей
	|			ПО ЗаданиеТорговомуПредставителюСАВ_Услуги.Ссылка = РСК_ОтраженныеУслугиСоисполнителей.ЗаданиеТорговомуПредставителю
	|				И ЗаданиеТорговомуПредставителюСАВ_Услуги.Номенклатура = РСК_ОтраженныеУслугиСоисполнителей.Услуга
	|				И (РСК_ОтраженныеУслугиСоисполнителей.Активно)
	|		ПО ВТ_ДокументыДляФормирования.Ссылка = ЗаданиеТорговомуПредставителюСАВ_Услуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Номенклатура,
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Цена,
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Содержание,
	|	ВТ_ДокументыДляФормирования.Ссылка,
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Количество
	|
	|ИМЕЮЩИЕ
	|	ЗаданиеТорговомуПредставителюСАВ_Услуги.Количество - СУММА(ЕСТЬNULL(РСК_ОтраженныеУслугиСоисполнителей.Количество, 0)) > 0"; 
	
	Результат = Запрос.Выполнить().Выгрузить();
	СписокСтрок.Загрузить(Результат);

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаПодборДокументов;
КонецПроцедуры

&НаКлиенте
Процедура СоисполнительПриИзменении(Элемент)
	ЗаполнитьСписокДокументов();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	СтруктураПараметров = СтрокиДляПереносаВДокумент();
	ПараметрыОснования  = Новый Структура("ДокументОснование,АдресСтрокВоВременномХранилище",
							ДокументОснование,СтруктураПараметров.АдресСтрокВоВременномХранилище);
	ПараметрыФормы      = Новый Структура("Основание,СтрокиКОтражению",ПараметрыОснования,СтруктураПараметров.АдресСтрокВоВременномХранилище);
	ОткрытьФорму("Документ.ПриобретениеУслугПрочихАктивов.ФормаОбъекта", ПараметрыФормы);  
	Закрыть();

КонецПроцедуры

&НаСервере
Функция СтрокиДляПереносаВДокумент() 
		
 	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеОтбора",СписокСтрок.Выгрузить());
	Запрос.УстановитьПараметр("Статья",ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("121008")); 
	Запрос.УстановитьПараметр("АналитикаРасходов",ПартнерСоисполнительДокументаОснования(ДокументОснование));
	Запрос.УстановитьПараметр("СтавкаНДС",Справочники.СтавкиНДС.БезНДС);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеОтбора.Содержание КАК Содержание,
	|	ДанныеОтбора.Количество КАК Количество,
	|	ДанныеОтбора.Цена КАК Цена,
	|	ДанныеОтбора.Сумма КАК Сумма,
	|	ДанныеОтбора.Документ КАК Документ,
	|	ДанныеОтбора.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_ДанныеОтбора
	|ИЗ
	|	&ДанныеОтбора КАК ДанныеОтбора
	|ГДЕ
	|	ДанныеОтбора.Пометка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеОтбора.Содержание КАК Содержание,
	|	ВТ_ДанныеОтбора.Количество КАК Количество,
	|	ВТ_ДанныеОтбора.Цена КАК Цена,
	|	ВТ_ДанныеОтбора.Сумма КАК Сумма,
	|	&Статья КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	&СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК РСК_ИдентификаторСтрокиЗадания,
	|	ВТ_ДанныеОтбора.Услуга КАК Услуга,
	|	ВТ_ДанныеОтбора.Документ КАК ЗаданиеТорговомуПредставителю,
	|	ЛОЖЬ КАК Активно,
	|	ВТ_ДанныеОтбора.Сумма КАК СуммаСНДС
	|ИЗ
	|	ВТ_ДанныеОтбора КАК ВТ_ДанныеОтбора"; 
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	Для Каждого Стр Из Результат Цикл
		Стр.РСК_ИдентификаторСтрокиЗадания = Строка(Новый УникальныйИдентификатор);	
	КонецЦикла;
	
    АдресВременногоХранилищаКОтражению = ПоместитьВоВременноеХранилище(Результат,Новый УникальныйИдентификатор);
	
	Возврат Новый Структура("АдресСтрокВоВременномХранилище",АдресВременногоХранилищаКОтражению);
	
КонецФункции  

&НаСервереБезКонтекста
Функция ПартнерСоисполнительДокументаОснования(ДокументОснование) 
	
	Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Склад"); 
	Если ЗначениеЗаполнено(Склад) Тогда
		Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад,"Поклажедержатель");
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент,"Партнер");	
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено; 
	
КонецФункции   

&НаКлиенте
Процедура СписокСтрокКоличествоВДокументПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.СписокСтрок.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		Если ТекущиеДанные.Количество > ТекущиеДанные.КоличествоДоступно Тогда
			ТекущиеДанные.Количество = ТекущиеДанные.КоличествоДоступно;	
		КонецЕсли;
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;	
	КонецЕсли;  
	
КонецПроцедуры
